OSCCAR/tutorials/multiphase/twoPhaseEulerFoam/RAS/fluidisedBedJohnsonJackson/0/Theta.particles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Theta.particles;
}
// ************************************************************************* //

dimensions          [ 0 2 -2 0 0 0 0 ];

internalField       uniform 0;

referenceLevel      1e-4;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 1e-4;
    }

    outlet
    {
        type               zeroGradient;
    }

    walls
    {
        // type               zeroGradient;
        //
        type               JohnsonJacksonParticleTheta;
        restitutionCoefficient 0.5;
        specularityCoefficient 0.01;
        value              uniform 1e-4;
    }

    frontAndBackPlanes
    {
        type               empty;
    }
}

// ************************************************************************* //
